package com.example.bunker.model;

public enum ActionTypeArtifact {

    /** Очищення (зняття зараження, лікування фізичного/психічного стану) */
    PURIFICATION,

    /** Прокляття (погіршення його стану) */
    CURSE,

    /** Захист (імунітет до викидів, голоду, хвороб або голосування) */
    PROTECTION,

    /** Шпигунство (дозволяє таємно подивитися чужий секрет, інвентар чи хобі) */
    ESPIONAGE,

    /** Заборона використовувати свій логос на один хід */
    STUN,

    /** Крадіжка чужих характеристик */
    STEALING

}
