package com.example.bunker.model;

public enum ActionTypeArtifact {

    /** Очищення (зняття зараження, лікування фізичного/психічного стану) */
    PURIFICATION,

    /** Прокляття (нанесення шкоди іншому гравцю або погіршення його стану) */
    CURSE,

    /** Захист (імунітет до викидів, голоду, хвороб або голосування) */
    PROTECTION,

    /** Шпигунство (дозволяє таємно подивитися чужий секрет, інвентар чи хобі) */
    ESPIONAGE,

    /** Руйнування (знищення чужого інвентаря або бункера) */
    DESTRUCTION,

    /** Маніпуляція (обмін характеристиками, картами чи зміна голосу) */
    MANIPULATION

}
